In [1]:
import pandas as pd
import numpy as np
import matplotlib as mp

In [2]:
df = pd.read_csv("friends.csv")

In [3]:
df

,Unnamed: 0,roomno,hotelno,address,das,dsadsa,dssadadsa
0,0,['1'],['2'],['idk'],['dasdsa'],['dsadsa'],NaN
1,1,['2'],['3'],['igk'],['dasdsdsaa'],NaN,['dsdsadsadsa']

In [4]:
data = {"product_name":["Keyboard","Mouse", "Monitor", "CPU","CPU", "Speakers",pd.NaT],
        "Unit_Price":[500,200, 5000.235, 10000.550, 10000.550, 250.50,None],
        "No_Of_Units":[5,5, 10, 20, 20, 8,pd.NaT],
        "Available_Quantity":[5,6,10,"Not Available","Not Available", pd.NaT,pd.NaT],
        "Available_Since_Date":['11/5/2021', '4/23/2021', '08/21/2021','09/18/2021','09/18/2021','01/05/2021',pd.NaT]
       }

In [5]:
datas=pd.DataFrame(data)

In [6]:
datas

  product_name  Unit_Price No_Of_Units Available_Quantity Available_Since_Date
0     Keyboard     500.000           5                  5            11/5/2021
1        Mouse     200.000           5                  6            4/23/2021
2      Monitor    5000.235          10                 10           08/21/2021
3          CPU   10000.550          20      Not Available           09/18/2021
4          CPU   10000.550          20      Not Available           09/18/2021
5     Speakers     250.500           8                NaT           01/05/2021
6          NaT         NaN         NaT                NaT                  NaT

In [7]:
datas.drop([5,6], axis=0, inplace=True)

In [8]:
datas

  product_name  Unit_Price No_Of_Units Available_Quantity Available_Since_Date
0     Keyboard     500.000           5                  5            11/5/2021
1        Mouse     200.000           5                  6            4/23/2021
2      Monitor    5000.235          10                 10           08/21/2021
3          CPU   10000.550          20      Not Available           09/18/2021
4          CPU   10000.550          20      Not Available           09/18/2021

In [14]:
datas.drop(df.index[2:4], inplace=True)

In [15]:
datas

  product_name  Unit_Price No_Of_Units Available_Quantity Available_Since_Date
0     Keyboard     500.000           5                  5            11/5/2021
1        Mouse     200.000           5                  6            4/23/2021
2      Monitor    5000.235          10                 10           08/21/2021

In [17]:
datas.drop(df.index[0:2], inplace=False)

  product_name  Unit_Price No_Of_Units Available_Quantity Available_Since_Date
2      Monitor    5000.235          10                 10           08/21/2021

In [19]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2